; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star3 - direction
	Star5 - direction
	GroundStation1 - direction
	Star2 - direction
	Star4 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star4)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star5)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared2)
	(supports instrument6 spectrograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 Star2)
	(supports instrument7 spectrograph1)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument8 infrared2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star5)
	(supports instrument9 thermograph0)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet14)
	(supports instrument10 thermograph0)
	(supports instrument10 infrared2)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 Star2)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon11)
)
(:goal (and
	(pointing satellite1 Phenomenon11)
	(pointing satellite3 Star4)
	(pointing satellite5 Phenomenon12)
	(have_image Star6 thermograph0)
	(have_image Planet7 thermograph0)
	(have_image Star8 thermograph0)
	(have_image Planet9 infrared2)
	(have_image Planet10 infrared2)
	(have_image Phenomenon11 spectrograph1)
	(have_image Phenomenon12 infrared2)
	(have_image Planet13 spectrograph1)
	(have_image Planet14 thermograph0)
))

)

; plan
1. (turn_to satellite5 phenomenon12 phenomenon11)
   deleted: (pointing satellite5 phenomenon11)
   added: (pointing satellite5 phenomenon12)
   goals met: 2 of 12
2. (turn_to satellite1 groundstation0 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 groundstation0)
   goals met: 2 of 12
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 12
4. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 2 of 12
5. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   goals met: 2 of 12
6. (take_image satellite1 planet7 instrument3 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 3 of 12
7. (turn_to satellite1 planet14 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet14)
   goals met: 3 of 12
8. (take_image satellite1 planet14 instrument3 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 4 of 12
9. (turn_to satellite1 planet13 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet13)
   goals met: 4 of 12
10. (take_image satellite1 planet13 instrument3 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 5 of 12
11. (turn_to satellite1 planet10 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet10)
   goals met: 5 of 12
12. (take_image satellite1 planet10 instrument3 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 6 of 12
13. (turn_to satellite1 phenomenon12 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon12)
   goals met: 6 of 12
14. (take_image satellite1 phenomenon12 instrument3 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 7 of 12
15. (turn_to satellite1 planet9 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet9)
   goals met: 7 of 12
16. (take_image satellite1 planet9 instrument3 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 8 of 12
17. (turn_to satellite1 star6 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star6)
   goals met: 8 of 12
18. (take_image satellite1 star6 instrument3 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 9 of 12
19. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   goals met: 9 of 12
20. (take_image satellite1 star8 instrument3 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 10 of 12
21. (turn_to satellite1 phenomenon11 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon11)
   goals met: 11 of 12
22. (take_image satellite1 phenomenon11 instrument3 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 12 of 12
